app/views/flights/index.html.erb


<%= pie_chart Seat.group(:flight_id).count %>
---
SELECT COUNT(*) AS count_all, "seats"."flight_id" AS seats_flight_id FROM "seats" GROUP BY "seats"."flight_id"