app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights"
SELECT COUNT(*) AS count_all, "seats"."flight_id" AS seats_flight_id FROM "seats" GROUP BY "seats"."flight_id"
SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ?  [["flight_id", 1]]
---
  def index
    @seat_class = SeatClass.all
    @flights = Flight.all
    @open_flights = []
    @closed_flights = []

    @flights.each do |f|
      if f.seats.length >= f.capacity then

INSERT INTO "flights" ("departure", "arrival", "destination", "baggage_allowance", "capacity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_flight
      @flight = Flight.find(params[:id])